<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTDPLIST1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads and builds a package that installs miniserve, a command-line tool to to serve files and dirs over HTTP. The resulting package installs to /usr/local/bin/miniserve</string>
        <key>Identifier</key>
        <string>com.github.zentralpro.pkg.miniserve</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>miniserve</string>
            <key>PKG_ID</key>
            <string>com.svenstaro.miniserve</string>
            <key>PKG_VERSION</key>
            <string>1.0.0</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.zentralpro.download.miniserve</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgdirs</key>
                    <dict>
                        <key>usr</key>
                        <string>0755</string>
                        <key>usr/local/</key>
                        <string>0755</string>
                        <key>usr/local/bin/</key>
                        <string>0775</string>
                    </dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/usr/local/bin/miniserve</string>
                    <key>overwrite</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                                <key>path</key>
                                <string>usr</string>
                                <key>user</key>
                                <string>root</string>
                            </dict>
                        </array>
                        <key>id</key>
                        <string>com.github.svenstaro.miniserve</string>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PathDeleter</string>
                <key>Comment</key>
                <string>Cleaning up</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%pkgroot%</string>
                    </array>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
