<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, packages and installs the latest version of miniserve, a command-line tool to serve files and dirs over HTTP. installs to /usr/local/bin/miniserve</string>
    <key>Identifier</key>
    <string>com.github.zentralpro.install.miniserve</string>
    <key>Input</key>
    <dict>
			<key>NAME</key>
			<string>miniserve</string>
		</dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.zentralpro.pkg.miniserve</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>