<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and installs the latest version of GitHub git-lfs tool.</string>
    <key>Identifier</key>
    <string>com.github.apfelwerk.install.yubiswitch</string>
    <key>Input</key>
    <dict>
			<key>INSTALL_DESTINATION</key>
			<string>/Applications</string>
		</dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apfelwerk.download.yubiswitch</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
						<key>Arguments</key>
						<dict>
							<key>dmg_path</key>
							<string>%pathname%</string>
							<key>items_to_copy</key>
							<array>
								<dict>
									<key>source_item</key>
									<string>yubiswitch.app</string>
									<key>destination_path</key>
									<string>%INSTALL_DESTINATION%</string>
									<key>user</key>
									<string>root</string>
									<key>group</key>
									<string>wheel</string>
                  <key>mode</key>
                  <string>0755</string>
								</dict>
							</array>
						</dict>
				</dict>
    </array>
</dict>
</plist>
