<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download iTaskX project management tool for macOS</string>
    <key>Identifier</key>
    <string>com.github.apfelwerk.download.itaskx</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>iTaskX3</string>
				<key>URL</key>
				<string>https://www.itaskx.com/downloads/iTaskX3.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
						<key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>

        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
            <key>input_path</key>
            <string>%pathname%/iTaskX3.app</string>
            <key>requirement</key>
            <string>anchor apple generic and identifier "at.techno-grafik.iTaskX3" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = N25S94343Z)</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
