<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, packages and imports to Munki the latest version of ProcessMonitor</string> 
    <key>Identifier</key>
    <string>com.github.zentralpro.munki.processmonitor</string>
    <key>ParentRecipe</key>
    <string>com.github.zentralpro.pkg.processmonitor</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Security</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Objective-See</string>
        <key>DISPLAY_NAME</key>
        <string>ProcessMonitor</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>ProcessMonitor, is a CLI tool delivered inside an App Bundle. Leveraging Apple's new Endpoint Security Framework, this utility monitors process creations and terminations, providing detailed information about such events.</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
