<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Chrome Remote Desktop and import it to munki</string>
	<key>Identifier</key>
    <string>com.github.apfelwerk.munki.chromeremotedesktop</string>
    <key>ParentRecipe</key>
    <string>com.github.apfelwerk.download.chromeremotedesktop</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Google</string>
        <key>DISPLAY_NAME</key>
        <string>Chrome Remote Desktop</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
			<string>Chrome Remote Desktop is a remote desktop software tool developed by Google that allows a user to remotely control another computer through a proprietary protocol developed by Google.</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <!-- NOTE!
          Make sure we have the correct version, not accidentally the version of the pkg itself
        -->
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%/Chrome Remote Desktop Host.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked/ChromeRemoteDesktopHostService.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked/</string>
                <key>purge_destination</key>
                <false/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/unpacked/Library/PrivilegedHelperTools/ChromeRemoteDesktopHost.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <!-- write version so we get the package names right -->
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
										<key>name</key>
										<string>%MUNKI_NAME%</string>
                </dict>
            </dict>
        </dict>
        <!-- and then we figure out the applications Info.plist information -->
        <dict>
            <key>Processor</key>
            <string>MunkiInstallsItemsCreator</string>
            <key>Arguments</key>
            <dict>
                <key>faux_root</key>
                <string>%RECIPE_CACHE_DIR%/unpacked/</string>
                <key>installs_item_paths</key>
                <array>
                    <string>/Library/PrivilegedHelperTools/ChromeRemoteDesktopHost.bundle/Contents/Info.plist</string>
                </array>
                <key>version_comparison_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/unpacked</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
