<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the current version of the Drata Agent and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.zentral.munki.DrataAgent</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>agents/drata</string>
      <key>NAME</key>
      <string>DrataAgent</string>
      <key>pkginfo</key>
      <dict>
        <key>blocking_applications</key>
        <array/>
        <key>catalogs</key>
        <array>
          <string>testing</string>
        </array>
        <key>description</key>
        <string>The Drata Agent is granted READ ONLY access to your system preferences to help ensure proper security configurations are set</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
        <key>minimum_os_version</key>
        <string>13.0.0</string>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.zentral.download.DrataAgent</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>
