<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTDPLIST1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download yq, a lightweight and portable command-line YAML processor. yq uses jq like syntax but works with yaml files as well as json.</string>
        <key>Identifier</key>
        <string>com.github.zentralpro.download.yq</string>
        <key>Input</key>
        <dict>
            <key>INCLUDE_PRERELEASES</key>
            <string></string>
            <key>NAME</key>
            <string>yq</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>include_prereleases</key>
                    <string>%INCLUDE_PRERELEASES%</string>
                    <key>github_repo</key>
                    <string>mikefarah/yq</string>
                    <key>asset_regex</key>
                    <string>yq_darwin_amd64.tar.gz</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.tar.gz</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
