<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and imports to Munki the latest version of xnumon, the sysmon-like monitoring agent that produces system activity logs.</string>
    <key>Identifier</key>
    <string>com.github.apfelwerk.munki.xnumon</string>
    <key>ParentRecipe</key>
    <string>com.github.apfelwerk.download.xnumon</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Monitoring</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Daniel Roethlisberger</string>
        <key>DISPLAY_NAME</key>
        <string>xnumon agent</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>xnumon is a monitoring agent that produces system activity logs intended to be suitable for monitoring potentially large fleets of macOS systems for malware and intrusions. It aims at providing similar capabilities on macOS that sysmon provides on Windows.</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
