<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ngrok, packages it, and imports to Munki</string>
    <key>Identifier</key>
    <string>com.github.apfelwerk.munki.ngrok</string>
    <key>ParentRecipe</key>
    <string>com.github.apfelwerk.pkg.ngrok</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ngrok</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Developer</string>
        <key>MUNKI_DEVELOPER</key>
        <string>ngrok</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>One command for an instant, secure URL to your localhost server through any NAT or firewall.</string>
            <key>display_name</key>
            <string>ngrok</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
     <!--           <key>pkg_path</key>
                <string>%pathname%</string>-->
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
