<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads ngrok (zip); the one command for an instant, secure URL to your localhost server through any NAT or firewall.</string>
    <key>Identifier</key>
    <string>com.github.apfelwerk.download.ngrok</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ngrok</string>
        <key>URL</key>
        <string>https://ngrok.com/download</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
          <key>Arguments</key>
          <dict>
            <key>url</key>
            <string>%URL%</string>
            <key>re_pattern</key>
            <string>https://bin.equinox.io/((.?)*)/ngrok-stable-darwin-amd64.zip</string>
            <key>result_output_var_name</key>
            <string>LINK_ELEMENT</string>
          </dict>
          <key>Processor</key>
          <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>ngrok-stable-darwin-amd64.zip</string>
                <key>url</key>
                <string>https://bin.equinox.io/%LINK_ELEMENT%/ngrok-stable-darwin-amd64.zip</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
<!--        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>-->
    </array>
</dict>
</plist>
