<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and builds a package that installs ngrok. The resulting package installs to /usr/local/bin/ngrok</string>
    <key>Identifier</key>
    <string>com.github.apfelwerk.pkg.ngrok</string>
    <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>ngrok</string>
            <key>PKG_ID</key>
    				<string>com.inconshreveable.ngrok</string>
						<key>PKG_VERSION</key>
						<string>2.2.8</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.0</string>
        <key>ParentRecipe</key>
        <string>com.github.apfelwerk.download.ngrok</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>usr</key>
                        <string>0755</string>
                        <key>usr/local</key>
                        <string>0755</string>
                        <key>usr/local/bin</key>
                        <string>0755</string>
                    </dict>
                </dict>
            </dict>
            <dict>
							<key>Processor</key>
							<string>Unarchiver</string>
							<key>Arguments</key>
							<dict>
									<key>archive_path</key>
									<string>%pathname%</string>
									<key>destination_path</key>
									<string>%pkgroot%/usr/local/bin/</string>
									<key>purge_destination</key>
									<true/>
							</dict>
        	</dict>
					<dict>
							<key>Processor</key>
							<string>PkgCreator</string>
							<key>Arguments</key>
							<dict>
									<key>pkgname</key>
									<string>%NAME%</string>
									<key>pkg_request</key>
									<dict>
											<key>pk§gdir</key>
											<string>%RECIPE_CACHE_DIR%</string>
											<key>id</key>
											<string>%PKG_ID%</string>
											<key>version</key>
											<string>%PKG_VERSION%</string>
											<key>options</key>
											<string>purge_ds_store</string>
											<key>chown</key>
											<array>
													<dict>
															<key>path</key>
															<string>usr</string>
															<key>user</key>
															<string>root</string>
															<key>group</key>
															<string>wheel</string>
													</dict>
											</array>
									</dict>
							</dict>
            </dict>
						<dict>
							<key>Processor</key>
							<string>PathDeleter</string>
							<key>Comment</key>
							<string>Cleaning up</string>
							<key>Arguments</key>
							<dict>
								<key>path_list</key>
								<string>%pkgroot%</string>
							</dict>
						</dict>
				</array>
</dict>
</plist>
