<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages the latest version of UXProtect. The resulting package installs to /Applications/UXProtect.app.</string>
    <key>Identifier</key>
    <string>com.github.apfelwerk.pkg.uxprotect</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>UXProtect</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apfelwerk.download.uxprotect</string>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>AppPkgCreator</string>
          <key>Arguments</key>
          <dict>
            <key>app_path</key>
            <string>%RECIPE_CACHE_DIR%/unpacked/UXProtect.app</string>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PathDeleter</string>
          <key>Comment</key>
          <string>Cleaning up</string>
          <key>Arguments</key>
          <dict>
            <key>path_list</key>
            <string>%RECIPE_CACHE_DIR%/unpacked</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
