<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, packages and installs the latest version of dog, the command-line DNS client. The package will be installed to /usr/local/bin.</string>
    <key>Identifier</key>
    <string>com.github.zentralpro.install.dog</string>
    <key>Input</key>
    <dict>
			<key>NAME</key>
			<string>dog</string>
		</dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.zentralpro.pkg.dog</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>