<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, packages and installs the latest version of vector, a high-performance, highly reliable, observability data pipeline. Installs to /usr/local/bin/vector</string>
    <key>Identifier</key>
    <string>com.github.zentralpro.install.vector</string>
    <key>Input</key>
    <dict>
			<key>NAME</key>
			<string>vector</string>
		</dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.zentralpro.pkg.vector</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>