<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages the latest version of Cutter for macOS, a free and Open Source Reverse Engineering Platform powered by Rizin. The resulting package installs to /Applications/Cutter.app.</string>
    <key>Identifier</key>
    <string>com.github.zentralpro.pkg.cutter</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Cutter</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.zentralpro.download.cutter</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
