<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, packages and imports to Munki the latest version of Nova, a native Mac code editor created by Panic Inc.</string>
    <key>Identifier</key>
    <string>com.github.zentralpro.munki.nova</string>
    <key>ParentRecipe</key>
    <string>com.github.zentralpro.download.nova</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Developer</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Panic Inc</string>
        <key>DISPLAY_NAME</key>
        <string>Nova</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Nova is a native Mac code editor created by Panic Inc.</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash

# Command line tool source and destination paths.
CMD_TOOL_SRC="/Applications/Nova.app/Contents/SharedSupport/nova"
CMD_TOOL_DST="/usr/local/bin"

if [[ -d "$CMD_TOOL_DST" ]]; then
    # Remove old tool, if it exists.
    rm -f "$CMD_TOOL_DST/nova"
else
    # Create destination folder, if it doesn't exist.
    mkdir -p "$CMD_TOOL_DST"
fi

cp "$CMD_TOOL_SRC" "$CMD_TOOL_DST/nova"
</string>
            <key>postuninstall_script</key>
            <string>#!/bin/bash
rm -f "/Library/LaunchDaemons/com.panic.NovaPrivilegedHelper.plist"
rm -f "/Library/PrivilegedHelperTools/com.panic.NovaPrivilegedHelper"
rm -f "/usr/local/bin/nova"
</string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/unarchived</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
