<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and packages the latest version of Overkill. Resulting pkg will install to /Applications/Overkill.app</string>
    <key>Identifier</key>
    <string>com.github.apfelwerk.pkg.Overkill</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Overkill</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apfelwerk.download.Overkill</string>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>PkgRootCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkgroot</key>
            <string>%RECIPE_CACHE_DIR%/pkgroot</string>
            <key>pkgdirs</key>
            <dict>
              <key>Applications</key>
              <string>0755</string>
            </dict>
          </dict>
        </dict>
				<dict>
					<key>Processor</key>
					<string>FileMover</string>
					<key>Arguments</key>
					<dict>
						<key>source</key>
						<string>%RECIPE_CACHE_DIR%/unarchived/Overkill.app</string>
						<key>target</key>
						<string>%pkgroot%/Applications/Overkill.app</string>
					</dict>
				</dict>
        <dict>
          <key>Processor</key>
          <string>PkgCreator</string>
          <key>Arguments</key>
          <dict>
            <key>pkgname</key>
            <string>%NAME%</string>
            <key>pkg_request</key>
            <dict>
              <key>pkgdir</key>
              <string>%RECIPE_CACHE_DIR%</string>
              <key>id</key>
              <string>com.krausefx.pkg.Overkill</string>
              <key>options</key>
              <string>purge_ds_store</string>
              <key>version</key>
              <string>%version%</string>
              <key>chown</key>
              <array>
                <dict>
                  <key>path</key>
                  <string>Applications</string>
                  <key>user</key>
                  <string>root</string>
                  <key>group</key>
                  <string>admin</string>
                </dict>
              </array>
            </dict>
          </dict>
        </dict>
        <dict>
          <key>Processor</key>
          <string>PathDeleter</string>
          <key>Comment</key>
          <string>Cleaning up</string>
          <key>Arguments</key>
          <dict>
            <key>path_list</key>
            <array>
							<string>%RECIPE_CACHE_DIR%/unarchived</string>
							<string>%pkgroot%</string>
						</array>
          </dict>
        </dict>
    </array>
</dict>
</plist>
