<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Overkill for macOS and extracts the app out of the downloaded zip.</string>
    <key>Identifier</key>
    <string>com.github.apfelwerk.download.Overkill</string>
    <key>Input</key>
    <dict>
        <key>INCLUDE_PRERELEASES</key>
        <string></string>
        <key>NAME</key>
        <string>Overkill</string>
				<key>DL_REGEX</key>
				<string>Overkill.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
              <key>include_prereleases</key>
              <string>%INCLUDE_PRERELEASES%</string>
              <key>github_repo</key>
              <string>KrauseFx/overkill-for-mac</string>
              <key>asset_regex</key>
							<string>%DL_REGEX%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%pathname%</string>
					<key>purge_destination</key>
					<true/>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unarchived/</string>
				</dict>
			</dict>
			<dict>
          <key>Processor</key>
          <string>CodeSignatureVerifier</string>
          <key>Arguments</key>
          <dict>
            <key>input_path</key>
            <string>%RECIPE_CACHE_DIR%/unarchived/Overkill.app</string>
            <key>requirement</key>
						<string>anchor apple generic and identifier "com.krausefx.Overkill" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = N8X438SEU2)</string>
          </dict>
        </dict>
    </array>
</dict>
</plist>
