<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of tcscertrequest, a command line tool to send a certificate request via RPCs to a Microsoft certificate authority</string>
    <key>Identifier</key>
    <string>com.github.apfelwerk.download.tcscertrequest</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>tcscertrequest</string>
        <key>URL</key>
        <string>https://bitbucket.org/twocanoes/tcscertrequest/downloads/</string>
				<key>RE_PATTERN</key>
				<string>(?P&lt;dl_filename&gt;tcscertrequest((\_|\-)(\d*\.?)*).pkg)</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
          <key>Processor</key>
          <string>URLTextSearcher</string>
          <key>Arguments</key>
          <dict>
            <key>url</key>
            <string>%URL%</string>
            <key>re_pattern</key>
            <string>%RE_PATTERN%</string>
						<key>result_output_var_name</key>
            <string>dl_filename</string>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%%dl_filename%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
				<dict>
					<key>Processor</key>
					<string>CodeSignatureVerifier</string>
					<key>Arguments</key>
					<dict>
						<key>input_path</key>
						<string>%pathname%</string>
						<key>expected_authority_names</key>
						<array>
								<string>Developer ID Installer: Twocanoes Software, Inc. (UXP6YEHSPW)</string>
								<string>Developer ID Certification Authority</string>
								<string>Apple Root CA</string>
						</array>
					</dict>
				</dict>
    </array>
</dict>
</plist>
