<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTDPLIST1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download cue, a command line tool for CUE an open-source data validation language.</string>
        <key>Identifier</key>
        <string>com.github.zentralpro.download.cue</string>
        <key>Input</key>
        <dict>
            <key>INCLUDE_PRERELEASES</key>
            <string></string>
            <key>NAME</key>
            <string>cue</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>include_prereleases</key>
                    <string>%INCLUDE_PRERELEASES%</string>
                    <key>github_repo</key>
                    <string>cuelang/cue</string>
                    <key>asset_regex</key>
                    <string>cue_[\d+].\d{0,2}.\d{0,2}-.*.\d{0,2}_Darwin_x86_64.tar.gz</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.tar.gz</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
