<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTDPLIST1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads, and imports to Munki the latest version of swiftDialog, an admin utility app for macOS 11+ written in SwiftUI that displays a popup dialog, displaying the content to your users that you want to display.\ The resulting package installs to '/Library/Application Support/Dialog/Dialog.app' and symlinks the CLI to '/usr/local/bin/dialog'.</string>
        <key>Identifier</key>
        <string>com.github.zentralpro.jamf.swiftDialog</string>
        <key>ParentRecipe</key>
        <string>com.github.zentralpro.download.swiftDialog</string>
        <key>MinimumVersion</key>
        <string>2.3</string>
        <key>Input</key>
         <dict>
            <key>CATEGORY</key>
            <string>Utility</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>GROUP_TEMPLATE</key>
            <string>SmartGroupTemplate.xml</string>
            <key>NAME</key>
            <string>swiftDialog</string>
            <key>OS_REQUIREMENTS</key>
            <string>11.x,12.x</string>
            <key>POLICY_CATEGORY</key>
            <string>Utility</string>
            <key>POLICY_NAME</key>
            <string>Install Latest %NAME%</string>
            <key>POLICY_TEMPLATE</key>
            <string>JamfPolicyTemplate.xml</string>
            <key>SELF_SERVICE_DESCRIPTION</key>
            <string>swiftDialog an admin utility app for macOS 11+ written in SwiftUI that displays a popup dialog, displaying the content to your users that you want to display.\ Installs to '/Library/Application Support/Dialog/Dialog.app' any symlink the CLI to '/usr/local/bin/dialog'.</string>
            <key>SELF_SERVICE_ICON</key>
            <string>Dialog.png</string>
            <key>UPDATE_PREDICATE</key>
            <string>pkg_uploaded == False</string>
        </dict>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>category_name</key>
                    <string>%CATEGORY%</string>
                </dict>
                <key>Processor</key>
                <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>os_requirements</key>
                    <string>%OS_REQUIREMENTS%</string>
                </dict>
                <key>Processor</key>
                <string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>predicate</key>
                    <string>%UPDATE_PREDICATE%</string>
                </dict>
                <key>Processor</key>
                <string>StopProcessingIf</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>computergroup_name</key>
                    <string>%GROUP_NAME%</string>
                    <key>computergroup_template</key>
                    <string>%GROUP_TEMPLATE%</string>
                </dict>
                <key>Processor</key>
                <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                    <key>policy_name</key>
                    <string>%POLICY_NAME%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                </dict>
                <key>Processor</key>
                <string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
            </dict>
        </array>
    </dict>
</plist>
