<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and installs swiftDialog, an admin utility app for macOS 11+ written in SwiftUI that displays a popup dialog, displaying the content to your users that you want to display.\ The downloaded package installs to '/Library/Application Support/Dialog/Dialog.app' and symlinks the CLI to '/usr/local/bin/dialog'.</string>
    <key>Identifier</key>
    <string>com.github.zentralpro.install.swiftDialog</string>
    <key>Input</key>
    <dict>
			<key>NAME</key>
			<string>swiftDialog</string>
		</dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.zentralpro.download.swiftDialog</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>