<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download SAP Privileges.app and import to Munki</string>
    <key>Identifier</key>
    <string>com.github.apfelwerk.munki.privileges</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.privileges</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Privileges</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_DEVELOPER</key>
        <string>SAP</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Privileges is an application for macOS which is designed to grant and remove admin rights from the logged-in user account</string>
            <key>display_name</key>
            <string>Privileges</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>